In [38]:
import numpy as np
import pandas as pd

In [39]:
titanic_data = pd.DataFrame(pd.read_csv("/content/Titanic_Survivors.csv"))
titanic_data.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [40]:
titanic_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [41]:
titanic_data.isnull()

     PassengerId  Survived  Pclass   Name  ...  Ticket   Fare  Cabin  Embarked
0          False     False   False  False  ...   False  False   True     False
1          False     False   False  False  ...   False  False  False     False
2          False     False   False  False  ...   False  False   True     False
3          False     False   False  False  ...   False  False  False     False
4          False     False   False  False  ...   False  False   True     False
..           ...       ...     ...    ...  ...     ...    ...    ...       ...
886        False     False   False  False  ...   False  False   True     False
887        False     False   False  False  ...   False  False  False     False
888        False     False   False  False  ...   False  False   True     False
889        False     False   False  False  ...   False  False  False     False
890        False     False   False  False  ...   False  False   True     False

[891 rows x 12 columns]

In [42]:
titanic_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

We would remove the columns which contains more than 35% values as null.

In [43]:
drp_col = titanic_data.isnull().sum()[titanic_data.isnull().sum()>(0.35 * titanic_data.shape[0])]
#It provides the column name which has more than 35% null values.
drp_col

Cabin    687
dtype: int64

Now we will drop the drp_col column as it does not lead to any conclusion.

In [44]:
titanic_data.drop(drp_col.index, axis=1,inplace=True )
titanic_data.head()

   PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0            1         0       3  ...         A/5 21171   7.2500         S
1            2         1       1  ...          PC 17599  71.2833         C
2            3         1       3  ...  STON/O2. 3101282   7.9250         S
3            4         1       1  ...            113803  53.1000         S
4            5         0       3  ...            373450   8.0500         S

[5 rows x 11 columns]

In [45]:
titanic_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [46]:
titanic_data["Family Size"] = titanic_data['SibSp'] + titanic_data['Parch']
titanic_data.head()

   PassengerId  Survived  Pclass  ...     Fare Embarked  Family Size
0            1         0       3  ...   7.2500        S            1
1            2         1       1  ...  71.2833        C            1
2            3         1       3  ...   7.9250        S            0
3            4         1       1  ...  53.1000        S            1
4            5         0       3  ...   8.0500        S            0

[5 rows x 12 columns]

In [47]:
titanic_data.drop(['SibSp','Parch'], axis=1, inplace=True)

In [48]:
titanic_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Ticket',
       'Fare', 'Embarked', 'Family Size'],
      dtype='object')

In [49]:
titanic_data.head()

   PassengerId  Survived  Pclass  ...     Fare Embarked  Family Size
0            1         0       3  ...   7.2500        S            1
1            2         1       1  ...  71.2833        C            1
2            3         1       3  ...   7.9250        S            0
3            4         1       1  ...  53.1000        S            1
4            5         0       3  ...   8.0500        S            0

[5 rows x 10 columns]

In [50]:
titanic_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
Ticket           0
Fare             0
Embarked         2
Family Size      0
dtype: int64

In [56]:
titanic_data.fillna(titanic_data.mean(), inplace=True)

In [57]:
titanic_data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
Ticket         0
Fare           0
Embarked       2
Family Size    0
dtype: int64

In [58]:
titanic_data['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [59]:
titanic_data['Embarked'].fillna('S', inplace=True)

In [60]:
titanic_data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
Ticket         0
Fare           0
Embarked       0
Family Size    0
dtype: int64

In [61]:
titanic_data.head()

   PassengerId  Survived  Pclass  ...     Fare Embarked  Family Size
0            1         0       3  ...   7.2500        S            1
1            2         1       1  ...  71.2833        C            1
2            3         1       3  ...   7.9250        S            0
3            4         1       1  ...  53.1000        S            1
4            5         0       3  ...   8.0500        S            0

[5 rows x 10 columns]

In [63]:
titanic_data['Sex'].describe()

count      891
unique       2
top       male
freq       577
Name: Sex, dtype: object

In [66]:
titanic_data['Alone'] = [0 if titanic_data['Family Size'][i]>0 else 1 for i in titanic_data.index]

In [67]:
titanic_data.corr()

             PassengerId  Survived    Pclass  ...      Fare  Family Size     Alone
PassengerId     1.000000 -0.005007 -0.035144  ...  0.012658    -0.040143  0.057462
Survived       -0.005007  1.000000 -0.338481  ...  0.257307     0.016639 -0.203367
Pclass         -0.035144 -0.338481  1.000000  ... -0.549500     0.065997  0.135207
Age             0.033207 -0.069809 -0.331339  ...  0.091566    -0.248512  0.179775
Fare            0.012658  0.257307 -0.549500  ...  1.000000     0.217138 -0.271832
Family Size    -0.040143  0.016639  0.065997  ...  0.217138     1.000000 -0.690922
Alone           0.057462 -0.203367  0.135207  ... -0.271832    -0.690922  1.000000

[7 rows x 7 columns]

In [69]:
titanic_data.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

# **Final Concludions on the DATA**

1. There were 64% mens in the titanic and women were about 36%

2. The passenger who was alone in the titanic had more chances of Survival

3. Passenger Class has direct relation with fare meaning the fare was high for the first class passengers and subsequenty less for second class and so on.

4. Age also has direct relation with fare  meaning less aged person leveraged less amount of fare while old people had spent more amount.

5. Upper passenger class persons survived mre as compared to persons in lower passenger classes.

6. Less aged persons survived more in the tragedy while old persons were more prone to death.